load-test.yml
config:
  target: "{{ $processEnvironment.CLOUD_HOST }}"
  phases:
    - name: Warm up
      duration: 10
      arrivalRate: 1
before:
  flow:
    - log: "로그인"
    - patch:
        url: "/user/login"
        auth:
          user: "{{ $processEnvironment.LOAD_TEST_USERNAME }}"
          pass: "{{ $processEnvironment.LOAD_TEST_PASSWORD }}"
        json:
          isAutoLogin: false
          fcmToken: null        
scenarios:
  - name: "한 챕터의 맞힌갯수 조회"
    flow:
      - get:
          url: "/history/chapter/hit-count?categorySeq=1&chapterNum=3"          
after:
  flow:
    - log: "로그아웃"
    - patch:
        url: "/user/logout"